### Q1. 
Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd
import numpy as np

data = np.array([4, 8, 15, 16, 23,  42])

In [7]:
df  =pd.Series(data)

In [8]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int32

### Q2.
Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
import pandas as pd

people_list = ['Abhishek','Aman','Subham','Krish','Sudhanshu','Deepak','Prajapati','Yogi','Ram']

my_series = pd.Series(people_list)

print(my_series)

0     Abhishek
1         Aman
2       Subham
3        Krish
4    Sudhanshu
5       Deepak
6    Prajapati
7         Yogi
8          Ram
dtype: object

### Q3.
Create a Pandas DataFrame that contains the following data:

In [10]:
import pandas as pd
import numpy as np

In [11]:
data= {'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}

In [12]:
data

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [14]:
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4.
What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
A DataFrame is a data structure that organizes data into a 2-dimensional table of rows
and columns, much like a spreadsheet.

In [ ]:
>Pandas Series
One-dimensional
Homogenous – Series elements must be of the same data type.
>Pandas DataFrame
Two-dimensional
Heterogenous – DataFrame elements can have different data types.

#### Series Example

In [15]:
import pandas as pd
import numpy as np
data = np.array([4, 8, 15, 16, 23,  42])
df  =pd.Series(data)
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int32

#### DataFrame Example

In [18]:
import pandas as pd
import numpy as np
data= {'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df = pd.DataFrame(data)

In [19]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q5.
What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
Dropping columns in the data.
Dropping rows in the data.
Renaming a column in the dataset.
Select columns with specific data types.
Slicing the dataset.

In [30]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [29]:
df.drop(['Age'],axis=1)

     Name  Gender
0   Alice  Female
1     Bob    Male
2  Claire  Female

## Q6. 
Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
 All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable.

## Q7. 
Create a DataFrame using multiple Series. Explain with an example.

In [31]:
import pandas as pd

In [32]:
author = ['Hari','Ramu','Shyamu']
article = [272,525,896]

In [34]:
auth_series = pd.Series(author)
art_series = pd.Series(article)

In [35]:
frame = {'Author':auth_series, 'Article':art_series}

In [36]:
result = pd.DataFrame(frame)

In [40]:
result

   Author  Article
0    Hari      272
1    Ramu      525
2  Shyamu      896